var x = 10;
var x = 20;
console.log(x); // Результат будет 20, потому что переменные, объявленные с использованием var, могут быть повторно объявлены

let y = 10;
// let y = 20; // Эта строка вызовет ошибку: "Identifier 'y' has already been declared", потому что переменные, объявленные с использованием let, не могут быть повторно объявлены

const z = 10;
// const z = 20; // Эта строка также вызовет ошибку: "Identifier 'z' has already been declared", потому что переменные, объяленные с использованием const, также не могут быть повторно объявлены
